## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place

Terraform will perform the following actions:

  # helm_release.argocd will be updated in-place
!   resource "helm_release" "argocd" {
        id                         = "argocd"
        name                       = "argocd"
        # (27 unchanged attributes hidden)

+       set {
+           name  = "configs.params.server.insecure"
+           value = "true"
        }
-       set {
-           name  = "server.insecure" -> null
-           value = "true" -> null
        }
    }

  # kubernetes_manifest.virtualservice_resource will be updated in-place
!   resource "kubernetes_manifest" "virtualservice_resource" {
!       object   = {
!           spec       = {
!               http     = [
!                   {
!                       match            = null -> [
+                           {
+                               authority       = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               gateways        = (known after apply)
+                               headers         = (known after apply)
+                               ignoreUriCase   = (known after apply)
+                               method          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               name            = (known after apply)
+                               port            = (known after apply)
+                               queryParams     = (known after apply)
+                               scheme          = {
+                                   exact  = (known after apply)
+                                   prefix = (known after apply)
+                                   regex  = (known after apply)
                                }
+                               sourceLabels    = (known after apply)
+                               sourceNamespace = (known after apply)
+                               statPrefix      = (known after apply)
+                               uri             = {
+                                   exact  = (known after apply)
+                                   prefix = "/"
+                                   regex  = (known after apply)
                                }
+                               withoutHeaders  = (known after apply)
                            },
                        ]
                        name             = null
!                       route            = [
!                           {
!                               destination = {
!                                   port   = {
!                                       number = 80 -> 443
                                    }
                                    # (2 unchanged elements hidden)
                                }
                                # (2 unchanged elements hidden)
                            },
                        ]
                        # (13 unchanged elements hidden)
                    },
                ]
                # (5 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
